# Construct and export a MySQL database using your data (Core)

## Deliverables

- Title Basics Transformation
- TMDB API Transformation
- MySQL Database export

## Imports & Load Data

In [1]:
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#Create a pandas dataframe for ratings (after files have been cleaned and uploaded)
title_ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)

In [3]:
#Create a pandas dataframe for basics (after files have been cleaned and uploaded)
title_basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)

In [4]:
#Create a pandas dataframe for ratings (after files have been cleaned and uploaded)
tmdb_data = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)

In [5]:
title_ratings.head(1)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1980

In [6]:
title_basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"

In [7]:
tmdb_data.head(1)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Title Basics Transformation

Convert the single string of genres from title basics into 2 new tables.<br>
1. **title_genres:**

- tconst
- genre_id

2. **genres:**

- genre_id
- genre_name

Discard unnecessary information:<br>
For the title basics table, drop the following columns:<br>
- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

### Normalizing Genres

#### 1. Getting a List of Unique Genres

In [8]:
## create a col with a list of genres
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"

In [9]:
#using explode to seperate out list of genres into new rows, one row for each genre
exploded_genres = title_basics.explode('genres_split')
exploded_genres.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance

In [10]:
#get the unique genres and sort them alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())

#### 2. Create new title_genres table

In [11]:
#create a new title_genres table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

#### 3. Create a genre mapper dictionary

In [12]:
# Make a dict with list of unique genres as the key and new integer id as values
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

#### 4. Replace the string genres in title_genres

In [13]:
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [14]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

#### 5. Convert genre map dictionary into a dict

In [15]:
#manually make dataframe with named cols from .keys and .values from genre_map
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                      'Genre_ID': genre_map.values()})

In [16]:
genres.head(2)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1

#### 6. Dropping specified columns in title_basics

- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [17]:
title_basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"

In [18]:
title_basics = title_basics.drop(columns=['originalTitle','isAdult','titleType','genres'])

In [19]:
#confirming that columns have been dropped
title_basics.head(1)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"[Comedy, Fantasy, Romance]"

Current Tables for MySQL Export:
- title_basics
- title_genres
- genres
- title_ratings
- tmdb_data

## TMDB Data Transformation

- You only need to keep the imdb_id, revenue, budget, and certification columns

In [20]:
tmdb_data.head(1)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [21]:
#keep only the specified columns and drop all the rest
tmdb_data = tmdb_data.loc[:, ['imdb_id', 'revenue', 'budget', 'certification']]

In [22]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

## MySQL Database Export

- Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.
- Create a new database on your MySQL server and call it "movies."
- Make sure to have the following tables in your "movies" database:

1. title_basics
2. title_ratings
3. title_genres
4. genres
5. tmdb_data

- Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [23]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [24]:
#create the engine to make connection between Python and MySQL
engine = create_engine(connection_str)

In [25]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

### title_basics

In [26]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86784 entries, 0 to 86783
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86784 non-null  object
 1   primaryTitle    86784 non-null  object
 2   startYear       86784 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  86784 non-null  int64
 5   genres_split    86784 non-null  object
dtypes: float64(1), int64(2), object(3)
memory usage: 4.0+ MB

In [27]:
title_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120,"[Drama, History]"
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,[Drama]
3,tt0069049,The Other Side of the Wind,2018,NaN,122,[Drama]
4,tt0088751,The Naked Monster,2005,NaN,100,"[Comedy, Horror, Sci-Fi]"

In [28]:
#dropping genres_split column from title_basics
title_basics = title_basics.drop(columns='genres_split')

In [29]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

In [30]:
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [31]:
# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

86784

In [32]:
#Add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [33]:
#showing first 5 rows of the title_basics table
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

### title_ratings

In [34]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 501156 entries, 0 to 501155
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         501156 non-null  object
 1   averageRating  501156 non-null  float64
 2   numVotes       501156 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [35]:
## Calculate max string lengths for object columns
key_len_2 = title_ratings['tconst'].fillna('').map(len).max()

In [36]:
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len_2+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [37]:
# Save to sql with dtype and index=False
title_ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

501156

In [38]:
#Add primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [39]:
#showing first 5 rows of the title_ratings table
q2 = """SELECT * FROM title_ratings LIMIT 5;"""
pd.read_sql(q2, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1980
1  tt0000002            5.8       265
2  tt0000005            6.2      2624
3  tt0000006            5.1       182
4  tt0000007            5.4       821

### title_genres

In [40]:
#does not need a primary key

In [41]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 162159 entries, 0 to 86783
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    162159 non-null  object
 1   genre_id  162159 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [42]:
## Calculate max string lengths for object columns
non_key_len = title_genres['tconst'].fillna('').map(len).max()

In [43]:
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": Text(non_key_len+1),
    'genre_id':Integer()}

In [44]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

162159

In [45]:
#showing first 5 rows of the title_genres table
q3 = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q3, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

### genres

In [46]:
#does not need a primary key

In [47]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [48]:
genres.head(1)

  Genre_Name  Genre_ID
0     Action         0

In [49]:
## Calculate max string lengths for object columns
genre_len = genres['Genre_Name'].fillna('').map(len).max()

In [50]:
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "Genre_Name": Text(genre_len+1),
    'Genre_ID':Integer()}

In [51]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

25

In [52]:
#showing first 5 rows of the title_genres table
q4 = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q4, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data

In [53]:
#does not need a primary key

In [54]:
tmdb_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2578 entries, 0 to 2577
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2578 non-null   object
 1   revenue        2576 non-null   float64
 2   budget         2576 non-null   float64
 3   certification  814 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.7+ KB

In [55]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

In [56]:
## Calculate max string lengths for object columns
tmdb_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

In [57]:
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(tmdb_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(cert_len+1)}

In [58]:
# Save to sql with dtype and index=False
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

2578

In [59]:
#showing first 5 rows of the title_genres table
q5 = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q5, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694  14204600.0    150000.0            PG

## Final SHOW TABLES run

In [60]:
q6 = """SHOW TABLES;"""
pd.read_sql(q6,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data